app/controllers/apis_controller.rb

	def categories
		categories = current_user.links.select('category')
---
SELECT "links"."category" FROM "links"  WHERE "links"."user_id" = $1  [["user_id", 44]]