app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"   ORDER BY "articles"."cached_votes_score" DESC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
	def index
		if params[:page]
			page = params[:page]
		else
			page = 1
		end
    if params[:per_page]
      per_page = params[:per_page]
    else
      per_page = 15
    end
    @articles = Article.order(:cached_votes_score => :desc).paginate(:page => page, :per_page => per_page)

SELECT  "articles".* FROM "articles"  WHERE (lower(title) LIKE lower('% ft.com %')
SELECT COUNT(*) FROM "articles"  WHERE (lower(title) LIKE lower('% ft.com %')
---
	def search
		if params[:page]
			@page = params[:page]
  		@title = "Search Results - "
		else
			@page = 1
      @title = "Search - "
		end
    if params[:per_page]
      per_page = params[:per_page]
    else
      per_page = 15
    end
		@articles = Article.search(params[:search]).paginate(:page => @page, :per_page => per_page)

INSERT INTO "articles" ("content", "link", "title") VALUES ($1, $2, $3) RETURNING "id"
---
    #     flash[:info] = "psst, we also added this to your links :)"
    #   end
    # end
    if @article.save