app/controllers/docs_controller.rb

SELECT "links".* FROM "links"  WHERE "links"."user_id" = $1 AND "links"."category" = ''  [["user_id", 44]]
---
	def link_from_cat
		puts params[:links]
		@links = current_user.links.where(category: params[:links])

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
---
	def article
		@article = Article.find(params[:article].to_i)