app/controllers/links_controller.rb

INSERT INTO "links" ("article_title", "category", "created_at", "date_accessed", "updated_at", "url", "user_id", "website_title") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
  	@user = current_user
  	@link = @user.links.new(permitted_params)
    @link.article_title = @link.article_title.strip
    @link.website_title = @link.website_title.strip
  	@link.user = current_user
  	if @link.save