app/controllers/pages_controller.rb

   def index
       @body = "home"
       @count = Article.count
---
SELECT COUNT(*) FROM "articles"

   def about
     @title = "About Cabretio - "
     @ft_count = Article.from_ft
     @count = Article.count
---
SELECT COUNT(*) FROM "articles"  WHERE (link LIKE '%ft.com%')