app/controllers/users_controller.rb

SELECT  "links".* FROM "links"  WHERE "links"."user_id" = $1  ORDER BY created_at DESC LIMIT 1  [["user_id", 44]]
SELECT DISTINCT COUNT(DISTINCT "links"."category") FROM "links"  WHERE "links"."user_id" = $1  [["user_id", 44]]
---
	def show
		if current_user
    		@user = current_user
    		@links = current_user.links.order("created_at DESC")
    		@title = "Your Page - "
        @categories = current_user.links.select('category').uniq!

INSERT INTO "users" ("created_at", "crypted_password", "email", "salt", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  	def create
    	@user = User.new(permitted_params)
    	if @user.save